Repository: C-EO/kdevelop
Catalog: po/*/kdevcustomdefinesandincludes.po
Languages: el

# @item no compiler
source: None
el: Κανένα

# @title:column
source: Name
el: Όνομα

# @title:column
source: Type
el: Τύπος

# @item
source: Auto-detected
el: Αυτόματη ανίχνευση

# @item
source: Manual
el: Χειροκίνητα

# @action
source: Delete Compiler
el: Διαγραφή μεταγλωττιστή

# @title:tab
source: C/C++ Compilers
el: C/C++ μεταγλωττιστές

# @title:tab
source: Configure C/C++ Compilers
el: Διαμόρφωση C/C++ μεταγλωττιστών

# @action:button
source: &Add
el: &Προσθήκη

# @action:button
source: &Remove
el: Αφαί&ρεση

# @label:textbox
source: Name:
el: Όνομα:

# @label:chooser
source: Compiler executable:
el: Εκτλέσιμο μεταγλωττιστή:

# @title:tab
source: Language Support
el: Υποστήριξη γλώσσας

# @title:tab
source: Configure Language Support
el: Διαμόρφωση υποστήριξης γλώσσας

source: Double-click here to insert a new define to be used for the path
el: Διπλό κλικ εδώ για εισαγωγή νέου define για χρήση για τη διαδρομή

# @title:column
source: Value
el: Τιμή

# @action
source: Delete Define
el: Διαγραφή define

# @action
source: Delete Include Path
el: Διαγραφή include διαδρομής

# %1 is an include path
source: %1 does not exist
el: Το %1 δεν υπάρχει

# @info:tooltip
source: Add the currently displayed URL to the list of includes if it is not in the list yet.
el: Προσθήκη του τρέχοντος εμφανιζόμενου URL στη λίστα των includes αν δεν είναι ακόμη στη λίστα.

# @info:placeholder
source: A new include path/file to use for parsing files under given directory
el: Μια νέα include διαδρομή/αρχείο για την ανάλυση αρχείων με τον δοσμένο κατάλογο

# @info:tooltip
source: Create a new include path entry from this URL
el: Δημιουργία μιας νέας εγγραφής include από αυτό το URL

# @info:tooltip
source: Delete current include path entry
el: Διαγραφή της τρέχουσας εγγραφής include διαδρομής

# @info:tooltip
source: <html><head/><body><p>Check this if you want <code>*.h</code> headers to be parsed in plain C mode. By default they are parsed as C++ headers.</p></body></html>
el: <html><head/><body><p>Ελέγξτε αυτό αν θέλετε οι <code>*.h</code> headers να αναλυθούν σε απλή C λειτουργία. Εξ ορισμού αναλύονται ως C++ headers.</p></body></html>

# @option:check
source: Parse *.h headers in plain C
el: Ανάλυση *.h σε απλή C

# @label:listbox
source: C++ profi&le:
el: C++ προφί&λ:

# @item:inlistbox language standard
source: Custom
el: Προσαρμοσμένο

# @label:textbox
source: C++ co&mmand-line arguments:
el: C++ ορίσ&ματα γραμμής εντολών:

# @label:listbox
source: C profi&le:
el: Ψ προφί&λ:

# @label:textbox
source: C co&mmand-line arguments:
el: C ορίσ&ματα γραμμής εντολών:

# @label:listbox
source: OpenCL C &profile:
el: OpenCL C &προφίλ:

# @label:textbox
source: OpenCL C comma&nd-line arguments:
el: OpenCL C ορίσματα γραμμής ε&ντολών:

# @label:listbox
source: CUDA C P&rofile:
el: CUDA C π&ροφίλ:

# @label:textbox
source: CUDA C comman&d-line arguments:
el: CUDA C ορίσμα&τα γραμμής εντολών:

# @title:window
source: Select Project Path
el: Επιλογή διαδρομής έργου

# @title:window
source: Edit Include Directories/Files
el: Επεξεργασία include καταλόγων/αρχείων

# @title:window
source: Edit Defined Macros
el: Επεξεργασία προκαθορισμένων μακροεντολών

source: Configure C/C++ parser
el: Διαμόρφωση C/C++ αναλυτών

source: Configure which macros and include directories/files will be added to the parser during project parsing:
el: Διαμόρφωση των μακροεντολών και include καταλόγων/αρχείων που θα προστεθούν στον αναλυτή κατά την ανάλυση του έργου:

# @info:tooltip
source: Check this if you want the project to be reparsed to apply the changes.
el: Επιλέξτε αυτό αν θέλετε το έργο να αναλυθεί ξανά για να εφαρμοστούν οι αλλαγές.

# @option:check
source: Reparse the project
el: Ανάλυση ξανά του έργου

# @info:tooltip
source: <html><head/><body><p>Select compiler that will be used to retrieve standard include directories and defined macros.</p></body></html>
el: <html><head/><body><p>Επιλέξτε το μεταγλωττιστή για την ανάκτηση τυπικών include καταλόγων και προκαθορισμένων μακροεντολών.</p></body></html>

# @label:listbox
source: Compiler for path:
el: Μεταγλωττιστής για διαδρομή:

# @action:button
source: &Batch Edit...
el: &Επεξεργασία δέσμης...

# @info:tooltip
source: Add a new sub-project path entry.
el: Προσθήκη μιας νέας εγγραφής διαδρομής υποέργου.

# @info:tooltip
source: Delete current sub-project path entry.
el: Διαγραφή της τρέχουσας εγγραφής διαδρομής υποέργου.

# @title:tab
source: C/C++ Parser
el: C/C++ αναλυτής

# @title:window
source: Setup Custom Include Paths
el: Ρύθμιση προσαρμοσμένων include διαδρομών

# @title:window
source: Select Directory to Include
el: Επιλογή καταλόγου για include

# @title:group
source: Storage Directory:
el: Κατάλογος αποθήκευσης:

# @info:tooltip
source: The custom include-path will be stored in a special file called ".kdev_include_paths" stored within a source directory.
el: Το προσαρμοσμένο include-path θα αποθηκευθεί σε ένα ειδικό αρχείο με όνομα «.kdev_include_paths» μέσα σε ένα κατάλογο πηγαίου κώδικα.

# @title:group
source: Custom include paths or #define's
el: Προσαρμοσμένες include διαδρομές ή #define

# @info:tooltip
source: The plain list of include paths. You may also define custom macros here by adding "#define NAME VALUE" lines.
el: Η απλή λίστα των include διαδρομών. Μπορείτε επίσης να ορίσετε εδώ προσαρμοσμένες μακροεντολές προσθέτοντας «#define NAME VALUE» γραμμές.

# @info:tooltip
source: Select a directory to include.
el: Επιλογή καταλόγου για include.

source: Failed to save custom include paths in directory: %1
el: Αποτυχία αποθήκευσης προσαρμοσμένων include διαδρομών στον κατάλογο: %1
